{
  "app": {
    "name": "ADManager Plus",
    "short_description": "App to create and manage Active Directory user accounts from Zendesk console.",
    "long_description": "**Who is the ADManager Plus app for?**\n\nIt is for the IT help desk technicians, and enables them to create and Active Directory user accounts from within Zendesk.\n\n**How will this app benefit Zendesk users?**\n\nUsing this app, IT service desk technicians can create accounts for users in Active Directory, Office 365, Exchange Server, Skype for Business, Lync, and G Suite, simultaneously. They can also reset passwords, enable or disable, unlock and delete user accounts, right from the menu in Zendesk.\n\n**Key Features**\n\nUsing the ADManager Plus app, Zendesk technicians can perform the following actions, right from within their help desk tool’s console:\n\n**- One-click employee onboarding and offboarding**\n\nActive Directory user account creation, along with Office 365, Exchange Server, Skype for Business, and G Suite accounts.\nActive Directory user account deletion.\n\n\n**- Simplified user account management**\n\nReset password\nUnlock user account\nEnable or disable user account\n\n\n\n**Release Notes**\n\n**Version 1.1**\n\n- A brand new user interface for server configuration.\n\n- Adds user association option which enables you to map Zendesk user to ADManager Plus HDT and restrict the HDTs to do only delegated actions.\n\n- User account creation in AD, Office 365, Exchange Server, Skype for Business, and G Suite.\n\n- AD user password reset\n\n- Enable or disable user account\n\n- User account unlock\n\n- User account deletion",
    "installation_instructions": "Integrate ManageEngine ADManager Plus with Zendesk for an efficient and quick help desi-driven Active Directory management.\n\n\n\n**Supported ADManager Plus versions**\n\nADManager Plus build **[7064](https://www.manageengine.com/products/ad-manager/service-pack.html?utm_source=zendesk&utm_medium=product&utm_campaign=zendesk_admanager&utm_content=zendesk_admanager)** and later versions.\n\n\n\n**To configure ADManager Plus app, / To integrate ADManager Plus app with Zendesk**\n\n- Log in to Zendesk.\n\n- Download ADManager Plus app from apps marketplace.\n\n- Click the **ADManager Plus icon** from the navigation pane on the left side of the console.\n\n- **[Download](https://www.manageengine.com/products/ad-manager/download.html?utm_source=zendesk&utm_medium=product&utm_campaign=zendesk_admanager&utm_content=zendesk_admanager)** and install ADManager Plus.\n\n\tNote: Ensure that version of ADManager Plus that you install is 7064 or above.\n\n- Specify the ADManager Plus server URL in it.\n\n- Enter the administrator’s credentials to complete the integration.\n\n\n You are now all set to create and manage your employees' Active Directory user accounts from Zendesk console.",
	"parameters": {
      "admpConfiguration": { "label": "ADManager Plus Configuration" },
      "admpDomainList": { "label": "ADManager Plus Domain List" },
      "admpZendeskMapping": { "label": "ADManager Plus Zendesk Mapping" }
    }
  }
}


